

#Расчитать площадь треугольника по ф-ле Герона

# a = int(input("Сторона А="))
# b = int(input("Сторона Б="))
# c = int(input("Сторона В="))
# p = (a + b + c)/2
# s = (p * (p - a)*(p - b)*(p - c))** 0.5
# print(s)

# Поменять местами значения двух переменных

# a = 5
# b = 6

# buf = a
# a = b
# b = buf

# Поменять местами значения двух числовых переменных без пользования третьей

# а = int(input("A="))
# b = int(input("B="))
# а ,b = b, а
# print("значение A=", а)
# print("значение B=", b)

# Запросить пользователя четное  число, вывести его квадрат,  затем запросить нечетное, вывести его удвоенное значение

# a = int(input("Введите четное число = "))
# print(a**2)
# b = int(input("Введите нечетное число = "))
# print(b*2)
